In [61]:
import pandas as pd
from sqlalchemy import create_engine
import numpy as np
import config

In [ ]:
# HEATHER

## Heather's Code
# Import CSV
fleet_csv = "./Resources/Fleet Data.csv"
fleet_df = pd.read_csv(fleet_csv)

# Dropping unnecessary columns, set the index 
cleaned_fleet = fleet_df.drop(columns=["Aircraft Type","Future","Historic","Total","Orders","Unit Cost","Average Age"]).fillna(value=0)
cleaned_fleet_df = cleaned_fleet.set_index(["Parent Airline"]+["Airline"])

# Remove ',','$' and blank values
cleaned_fleet_df["Total Cost (Current)"] = cleaned_fleet_df["Total Cost (Current)"].str.replace(',', '')
cleaned_fleet_df["Total Cost (Current)"] = cleaned_fleet_df["Total Cost (Current)"].str.replace('$', '')
cleaned_fleet_df = cleaned_fleet_df.dropna()

# Set the objects to integer
cleaned_fleet_df["Total Cost (Current)"] = cleaned_fleet_df["Total Cost (Current)"].astype(str).astype(int)

# Aggregate Columns to Sum
agg_fleet_df = cleaned_fleet_df.groupby(["Parent Airline","Airline"]).agg({"Current":"sum",
                                                                           "Total Cost (Current)":"sum"})
agg_fleet_df

In [ ]:
## Michael's code
# Import CSV
airline_csv = "./Resources/Largest Airlines 2015 with Origin or Destination in USA.csv"
airline_df = pd.read_csv(airline_csv)
airline_df.columns

# Clean up the columns
cleaned_airline = airline_df.drop(columns=[" FREIGHT "," MAIL "])
cleaned_airline_df = cleaned_airline.rename(columns={" PASSENGERS ":"Passengers",
                                                     " Passenger Miles ":"Passenger Miles",
                                                     "CARRIER_NAME":"Parent Airline"})
# Remove ','
cleaned_airline_df["Passengers"] = cleaned_airline_df["Passengers"].str.replace(',', '')
cleaned_airline_df["Passenger Miles"] = cleaned_airline_df["Passenger Miles"].str.replace(',', '')

# Set the objects to integer
cleaned_airline_df["Passengers"] = cleaned_airline_df["Passengers"].astype(str).astype(np.int64)
cleaned_airline_df["Passenger Miles"] = cleaned_airline_df["Passenger Miles"].astype(str).astype(np.int64)

cleaned_airline_df

In [62]:
# MICHAEL

csv_file = "Resources/Fleet Data.csv"
fleet_data_df = pd.read_csv(csv_file)
fleet_data_df.head()

,Parent Airline,Airline,Aircraft Type,Current,Future,Historic,Total,Orders,Unit Cost,Total Cost (Current),Average Age
0,Aegean Airlines,Aegean Airlines,Airbus A319,1.0,NaN,3.0,4.0,NaN,$90,$90,11.6
1,Aegean Airlines,Olympic Air,Airbus A319,NaN,NaN,8.0,8.0,NaN,$90,$0,NaN
2,Aegean Airlines,Aegean Airlines,Airbus A320,38.0,NaN,3.0,41.0,NaN,$98,"$3,724",7.5
3,Aegean Airlines,Olympic Air,Airbus A320,NaN,NaN,9.0,9.0,NaN,$98,$0,NaN
4,Aegean Airlines,Aegean Airlines,Airbus A321,8.0,NaN,NaN,8.0,NaN,$115,$919,10.3

In [63]:
fleet_data_df.columns

Index(['Parent Airline', 'Airline', 'Aircraft Type', 'Current', 'Future',
       'Historic', 'Total', 'Orders', 'Unit Cost', 'Total Cost (Current)',
       'Average Age'],
      dtype='object')

In [64]:
csv_file = "Resources/Largest Airlines 2015 with Origin or Destination in USA.csv"
passenger_data_df = pd.read_csv(csv_file)
passenger_data_df.head()

,PASSENGERS,FREIGHT,MAIL,Passenger Miles,CARRIER_NAME
0,"144,637,180","289,611,118",-,"116,627,136,731",Southwest Airlines Co. Total
1,"137,916,298","975,245,401","240,169,831","186,140,690,281",Delta Air Lines Inc. Total
2,"118,541,411","987,757,310","153,541,964","166,869,071,222",American Airlines Inc. Total
3,"95,028,877","968,514,741","356,224,690","182,508,547,016",United Air Lines Inc. Total
4,"35,130,683","26,557,394",-,"41,726,258,863",JetBlue Airways Total

In [65]:
passenger_data_df.columns

Index([' PASSENGERS ', ' FREIGHT ', ' MAIL ', ' Passenger Miles ',
       'CARRIER_NAME'],
      dtype='object')

In [84]:
clean_fleet_data_df = fleet_data_df[['Parent Airline', 'Airline', 'Aircraft Type', 'Current', 'Unit Cost', 'Total Cost (Current)']].copy()
clean_fleet_data_df.head()

,Parent Airline,Airline,Aircraft Type,Current,Unit Cost,Total Cost (Current)
0,Aegean Airlines,Aegean Airlines,Airbus A319,1.0,$90,$90
1,Aegean Airlines,Olympic Air,Airbus A319,NaN,$90,$0
2,Aegean Airlines,Aegean Airlines,Airbus A320,38.0,$98,"$3,724"
3,Aegean Airlines,Olympic Air,Airbus A320,NaN,$98,$0
4,Aegean Airlines,Aegean Airlines,Airbus A321,8.0,$115,$919

In [86]:
clean_fleet_data_df = clean_fleet_data_df.rename(columns={'Total Cost (Current)': 'Total Cost'})
clean_fleet_data_df.head()

,Parent Airline,Airline,Aircraft Type,Current,Unit Cost,Total Cost
0,Aegean Airlines,Aegean Airlines,Airbus A319,1.0,$90,$90
1,Aegean Airlines,Olympic Air,Airbus A319,NaN,$90,$0
2,Aegean Airlines,Aegean Airlines,Airbus A320,38.0,$98,"$3,724"
3,Aegean Airlines,Olympic Air,Airbus A320,NaN,$98,$0
4,Aegean Airlines,Aegean Airlines,Airbus A321,8.0,$115,$919

In [67]:
clean_passenger_data_df = passenger_data_df[[' PASSENGERS ', ' Passenger Miles ', 'CARRIER_NAME']].copy()
clean_passenger_data_df.head()

     PASSENGERS    Passenger Miles                   CARRIER_NAME
0   144,637,180    116,627,136,731   Southwest Airlines Co. Total
1   137,916,298    186,140,690,281     Delta Air Lines Inc. Total
2   118,541,411    166,869,071,222   American Airlines Inc. Total
3    95,028,877    182,508,547,016    United Air Lines Inc. Total
4    35,130,683     41,726,258,863          JetBlue Airways Total

In [68]:
clean_passenger_data_df = clean_passenger_data_df.rename(columns={' PASSENGERS ': 'Passengers',
                                                         ' Passenger Miles ': 'Passenger Miles',
                                                         'CARRIER_NAME': 'Parent Airline'})
clean_passenger_data_df.head()

      Passengers    Passenger Miles                Parent Airline
0   144,637,180    116,627,136,731   Southwest Airlines Co. Total
1   137,916,298    186,140,690,281     Delta Air Lines Inc. Total
2   118,541,411    166,869,071,222   American Airlines Inc. Total
3    95,028,877    182,508,547,016    United Air Lines Inc. Total
4    35,130,683     41,726,258,863          JetBlue Airways Total

In [69]:
clean_passenger_data_df.dtypes

Passengers         object
Passenger Miles    object
Parent Airline     object
dtype: object

In [70]:
clean_passenger_data_df['Passengers'] = clean_passenger_data_df['Passengers'].str.strip()

In [71]:
clean_passenger_data_df.head()

    Passengers    Passenger Miles                Parent Airline
0  144,637,180   116,627,136,731   Southwest Airlines Co. Total
1  137,916,298   186,140,690,281     Delta Air Lines Inc. Total
2  118,541,411   166,869,071,222   American Airlines Inc. Total
3   95,028,877   182,508,547,016    United Air Lines Inc. Total
4   35,130,683    41,726,258,863          JetBlue Airways Total

In [72]:
clean_passenger_data_df['Passengers'] = clean_passenger_data_df['Passengers'].str.replace(',', '')
clean_passenger_data_df.head()

  Passengers    Passenger Miles                Parent Airline
0  144637180   116,627,136,731   Southwest Airlines Co. Total
1  137916298   186,140,690,281     Delta Air Lines Inc. Total
2  118541411   166,869,071,222   American Airlines Inc. Total
3   95028877   182,508,547,016    United Air Lines Inc. Total
4   35130683    41,726,258,863          JetBlue Airways Total

In [73]:
clean_passenger_data_df['Passenger Miles'] = clean_passenger_data_df['Passenger Miles'].str.replace(',', '')
clean_passenger_data_df.head()

  Passengers Passenger Miles                Parent Airline
0  144637180   116627136731   Southwest Airlines Co. Total
1  137916298   186140690281     Delta Air Lines Inc. Total
2  118541411   166869071222   American Airlines Inc. Total
3   95028877   182508547016    United Air Lines Inc. Total
4   35130683    41726258863          JetBlue Airways Total

In [74]:
clean_passenger_data_df['Passenger Miles'] = clean_passenger_data_df['Passenger Miles'].astype(str).astype(int)
clean_passenger_data_df.dtypes

Passengers         object
Passenger Miles     int64
Parent Airline     object
dtype: object

In [82]:
clean_passenger_data_df['Passengers'].sort_values(ascending=False)
clean_passenger_data_df.head(10)

  Passengers  Passenger Miles                  Parent Airline
0  144637180     116627136731    Southwest Airlines Co. Total
1  137916298     186140690281      Delta Air Lines Inc. Total
2  118541411     166869071222    American Airlines Inc. Total
3   95028877     182508547016     United Air Lines Inc. Total
4   35130683      41726258863           JetBlue Airways Total
5   30078314      16965403368     SkyWest Airlines Inc. Total
6   28269616      32330747593           US Airways Inc. Total
7   26002874      12683188091  ExpressJet Airlines Inc. Total
8   22868140      30301282863      Alaska Airlines Inc. Total
9   17629033      17944023815          Spirit Air Lines Total

In [76]:
# CONNECT TO LOCAL DATABASE

In [77]:
connection_string = f"{config.user}:{config.pw}@localhost:5432/airlines_db"
engine = create_engine(f'postgresql://{connection_string}')

In [78]:
engine.table_names()

[]

In [81]:
clean_passenger_data_df.to_sql(name='passenger_name', con=engine, if_exists='append', index=False)

In [83]:
pd.read_sql_query('select * from passenger_name', con=engine).head()

  Passengers  Passenger Miles                Parent Airline
0  144637180     116627136731  Southwest Airlines Co. Total
1  137916298     186140690281    Delta Air Lines Inc. Total
2  118541411     166869071222  American Airlines Inc. Total
3   95028877     182508547016   United Air Lines Inc. Total
4   35130683      41726258863         JetBlue Airways Total